renesas/rx72n-envision-kit/projects/renesas/vendors/renesas/rx_driver_package/v125/r_sdc_sdmem_rx/src/r_sdc_sd_wrapper.c
    return ret;
} /* End of function R_SDC_SD_Close() */

/**********************************************************************************************************************
* Outline      : Get Buffer Register Address
* Function Name: R_SDC_SD_GetBuffRegAddress
* Description  : Gets the Buffer Register Address.
* Arguments    : uint32_t           card_no             ;   SD Card No.
*              : uint32_t           * p_reg_buff        ;   Buffer Register Address
* Return Value : SDC_SD_SUCCESS                         ;   Successful operation
*              : SDC_SD_ERR                             ;   Failed operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t R_SDC_SD_GetBuffRegAddress(uint32_t card_no, uint32_t * p_reg_buff)
{
#if (BSP_CFG_PARAM_CHECKING_ENABLE)
    if (SDC_SD_CFG_CARD_NUM <= card_no)
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_WRAPPER, __LINE__);
        return SDC_SD_ERR;
    }
#endif /* BSP_CFG_PARAM_CHECKING_ENABLE */

    return r_sdc_sd_GetBuffRegAddress(card_no, p_reg_buff);
} /* End of function R_SDC_SD_GetBuffRegAddress() */

/**********************************************************************************************************************
* Outline      : Get Version
* Function Name: R_SDC_SD_GetVersion
* Description  : Returns the version of this module. The version number is
*                encoded such that the top two bytes are the major version
*                number and the bottom two bytes are the minor version number.
* Arguments    : none
* Return Value : version number
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
uint32_t  R_SDC_SD_GetVersion(void)
{
    return r_sdc_sd_GetVersion();
} /* End of function R_SDC_SD_GetVersion() */

/**********************************************************************************************************************
* Outline      : SDC_SD 1ms Interval
* Function Name: R_SDC_SD_1msInterval
* Description  : 1ms Interval Timer call function.
* Arguments    : None
* Return Value : None
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
void R_SDC_SD_1msInterval(void)
{
    r_sdc_sd_1msInterval();
} /* End of function R_SDC_SD_1msInterval() */

/**********************************************************************************************************************
* Outline      : Set DMAC/DTC transfer End Flag
* Function Name: R_SDC_SD_SetDmacDtcTransFlg
* Description  : Sets DMAC/DTC transfer end flag.
* Arguments    : uint32_t           card_no             ;   SD Card No.
*              : uint32_t           flg                 ;   Transfer: 1  No transfer: 0 
* Return Value : SDC_SD_SUCCESS                         ;   Successful operation
*              : SDC_SD_ERR                             ;   Failed operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t R_SDC_SD_SetDmacDtcTransFlg(uint32_t card_no, uint32_t flg)
{
#if (BSP_CFG_PARAM_CHECKING_ENABLE)
    if (SDC_SD_CFG_CARD_NUM <= card_no)
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_WRAPPER, __LINE__);
        return SDC_SD_ERR;
    }
#endif /* BSP_CFG_PARAM_CHECKING_ENABLE */

    return r_sdc_sd_SetDmacDtcTransFlg(card_no, flg);
} /* End of function R_SDC_SD_SetDmacDtcTransFlg() */

/**********************************************************************************************************************
* Outline      : Get Log HNDL Address
* Function Name: R_SDC_SD_SetLogHdlAddress
* Description  : Gets the Log HNDL Address.
* Arguments    : uint32_t           user_byte_que       ;   user_byte_que
* Return Value : SDC_SD_SUCCESS                         ;   Successful operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t R_SDC_SD_SetLogHdlAddress(uint32_t user_long_que)
{
    return r_sdc_sd_SetLogHdlAddress(user_long_que);
} /* End of function R_SDC_SD_SetLogHdlAddress() */

/**********************************************************************************************************************
* Outline      : Store Debugging Information
* Function Name: R_SDC_SD_Log
* Description  : Stores the debugging information.
* Arguments    : uint32_t           flg                 ;   Breakpoint processing
*              : uint32_t           fid                 ;   SDHI driver file No.
*              : uint32_t           line                ;   SDHI driver line No.
* Return Value : 0
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
uint32_t R_SDC_SD_Log(uint32_t flg, uint32_t fid, uint32_t line)
{
    return r_sdc_sd_Log(flg, fid, line);
} /* End of function R_SDC_SD_Log() */

/* End of File */
